// arr 함수들
// map: 바꿔줘
// filter: 걸러줘, 어떠한 조건에 부합하는 요소만 남겨줘

[10, 20, 30, 40, 50].filter((x) => {
  return 30 > x;
});
[10, 20, 30, 40, 50].filter((x) => {
  return x == 20 || x == 40;
});

// every: 어떠한 조건에 모든 요소가 부합함?(return Boolean)
[10, 20, 30, 40, 50].every((x) => {
  return x > 10;
});

// some: 어떠한 조건에 하나 요소가 부합함?(return Boolean)
[10, 20, 30, 40, 50].some((x) => {
  return x > 60;
});

// 배열만들기
// 열칸 만들기[]
// [1,2,3,4,5,6,7,8,9,...100]
// [0,1,2,3,4,...99]
// Array(20)
//   .fill(0)
//   .map((x, i) => {
//     return i;
//   });
